Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: وإذ قلنا للملائكة اسجدوا لآدم فسجدوا إلا إبليس كان من الجن ففسق عن أمر ربه أفتتخذونه وذريته أولياء من دوني وهم لكم عدو بئس للظالمين بدلا
en: Behold! We said to the angels, "Bow down to Adam": They bowed down except Iblis. He was one of the Jinns, and he broke the Command of his Lord. Will ye then take him and his progeny as protectors rather than Me? And they are enemies to you! Evil would be the exchange for the wrong-doers!

source: ما أشهدتهم خلق السماوات والأرض ولا خلق أنفسهم وما كنت متخذ المضلين عضدا
en: I called them not to witness the creation of the heavens and the earth, nor (even) their own creation: nor is it for helpers such as Me to take as lead (men) astray!

source: ويوم يقول نادوا شركائي الذين زعمتم فدعوهم فلم يستجيبوا لهم وجعلنا بينهم موبقا
en: One Day He will say, "Call on those whom ye thought to be My partners," and they will call on them, but they will not listen to them; and We shall make for them a place of common perdition.

source: ورأى المجرمون النار فظنوا أنهم مواقعوها ولم يجدوا عنها مصرفا
en: And the Sinful shall see the fire and apprehend that they have to fall therein: no means will they find to turn away therefrom.

source: ولقد صرفنا في هذا القرآن للناس من كل مثل وكان الإنسان أكثر شيء جدلا
en: We have explained in detail in this Qur'an, for the benefit of mankind, every kind of similitude: but man is, in most things, contentious.

source: وما منع الناس أن يؤمنوا إذ جاءهم الهدى ويستغفروا ربهم إلا أن تأتيهم سنة الأولين أو يأتيهم العذاب قبلا
en: And what is there to keep back men from believing, now that Guidance has come to them, nor from praying for forgiveness from their Lord, but that (they ask that) the ways of the ancients be repeated with them, or the Wrath be brought to them face to face?

source: وما نرسل المرسلين إلا مبشرين ومنذرين ويجادل الذين كفروا بالباطل ليدحضوا به الحق واتخذوا آياتي وما أنذروا هزوا
en: We only send the messengers to give Glad Tidings and to give warnings: But the unbelievers dispute with vain argument, in order therewith to weaken the truth, and they treat My Signs as a jest, as also the fact that they are warned!

source: ومن أظلم ممن ذكر بآيات ربه فأعرض عنها ونسي ما قدمت يداه إنا جعلنا على قلوبهم أكنة أن يفقهوه وفي آذانهم وقرا وإن تدعهم إلى الهدى فلن يهتدوا إذا أبدا
en: And who doth more wrong than one who is reminded of the Signs of his Lord, but turns away from them, forgetting the (deeds) which his hands have sent forth? Verily We have set veils over their hearts lest they should understand this, and over their ears, deafness, if thou callest them to guidance, even then will they never accept guidance.

source: وربك الغفور ذو الرحمة لو يؤاخذهم بما كسبوا لعجل لهم العذاب بل لهم موعد لن يجدوا من دونه موئلا
en: But your Lord is Most forgiving, full of Mercy. If He were to call them (at once) to account for what they have earned, then surely He would have hastened their punishment: but they have their appointed time, beyond which they will find no refuge.

source: وتلك القرى أهلكناهم لما ظلموا وجعلنا لمهلكهم موعدا
en: Such were the populations we destroyed when they committed iniquities; but we fixed an appointed time for their destruction.

source: وإذ قال موسى لفتاه لا أبرح حتى أبلغ مجمع البحرين أو أمضي حقبا
en: Behold, Moses said to his attendant, "I will not give up until I reach the junction of the two seas or (until) I spend years and years in travel."

source: فلما بلغا مجمع بينهما نسيا حوتهما فاتخذ سبيله في البحر سربا
en: But when they reached the Junction, they forgot (about) their Fish, which took its course through the sea (straight) as in a tunnel.

source: فلما جاوزا قال لفتاه آتنا غداءنا لقد لقينا من سفرنا هذا نصبا
en: When they had passed on (some distance), Moses said to his attendant: "Bring us our early meal; truly we have suffered much fatigue at this (stage of) our journey."

source: قال أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت وما أنسانيه إلا الشيطان أن أذكره واتخذ سبيله في البحر عجبا
en: He replied: "Sawest thou (what happened) when we betook ourselves to the rock? I did indeed forget (about) the Fish: none but Satan made me forget to tell (you) about it: it took its course through the sea in a marvellous way!"

source: قال ذلك ما كنا نبغ فارتدا على آثارهما قصصا
en: Moses said: "That was what we were seeking after:" So they went back on their footsteps, following (the path they had come).

source: فوجدا عبدا من عبادنا آتيناه رحمة من عندنا وعلمناه من لدنا علما
en: So they found one of Our servants, on whom We had bestowed Mercy from Ourselves and whom We had taught knowledge from Our own Presence.

source: قال له موسى هل أتبعك على أن تعلمن مما علمت رشدا
en: Moses said to him: "May I follow thee, on the footing that thou teach me something of the (Higher) Truth which thou hast been taught?"

source: قال إنك لن تستطيع معي صبرا
en: (The other) said: "Verily thou wilt not be able to have patience with me!"

source: وكيف تصبر على ما لم تحط به خبرا
en: "And how canst thou have patience about things about which thy understanding is not complete?"

source: قال ستجدني إن شاء الله صابرا ولا أعصي لك أمرا
en: Moses said: "Thou wilt find me, if Allah so will, (truly) patient: nor shall I disobey thee in aught."

source: قال فإن اتبعتني فلا تسألني عن شيء حتى أحدث لك منه ذكرا
en: The other said: "If then thou wouldst follow me, ask me no questions about anything until I myself speak to thee concerning it."

source: فانطلقا حتى إذا ركبا في السفينة خرقها قال أخرقتها لتغرق أهلها لقد جئت شيئا إمرا
en: So they both proceeded: until, when they were in the boat, he scuttled it. Said Moses: "Hast thou scuttled it in order to drown those in it? Truly a strange thing hast thou done!"

source: قال ألم أقل إنك لن تستطيع معي صبرا
en: He answered: "Did I not tell thee that thou canst have no patience with me?"

source: قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا
en: Moses said: "Rebuke me not for forgetting, nor grieve me by raising difficulties in my case."

source: فانطلقا حتى إذا لقيا غلاما فقتله قال أقتلت نفسا زكية بغير نفس لقد جئت شيئا نكرا
en: Then they proceeded: until, when they met a young man, he slew him. Moses said: "Hast thou slain an innocent person who had slain none? Truly a foul (unheard of) thing hast thou done!"

source: قال ألم أقل لك إنك لن تستطيع معي صبرا
en: He answered: "Did I not tell thee that thou canst have no patience with me?"

source: قال إن سألتك عن شيء بعدها فلا تصاحبني قد بلغت من لدني عذرا
en: (Moses) said: "If ever I ask thee about anything after this, keep me not in thy company: then wouldst thou have received (full) excuse from my side."

source: فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها فأبوا أن يضيفوهما فوجدا فيها جدارا يريد أن ينقض فأقامه قال لو شئت لاتخذت عليه أجرا
en: Then they proceeded: until, when they came to the inhabitants of a town, they asked them for food, but they refused them hospitality. They found there a wall on the point of falling down, but he set it up straight. (Moses) said: "If thou hadst wished, surely thou couldst have exacted some recompense for it!"

source: قال هذا فراق بيني وبينك سأنبئك بتأويل ما لم تستطع عليه صبرا
en: He answered: "This is the parting between me and thee: now will I tell thee the interpretation of (those things) over which thou wast unable to hold patience.

source: أما السفينة فكانت لمساكين يعملون في البحر فأردت أن أعيبها وكان وراءهم ملك يأخذ كل سفينة غصبا
en: "As for the boat, it belonged to certain men in dire want: they plied on the water: I but wished to render it unserviceable, for there was after them a certain king who seized on every boat by force.

source: وأما الغلام فكان أبواه مؤمنين فخشينا أن يرهقهما طغيانا وكفرا
en: "As for the youth, his parents were people of Faith, and we feared that he would grieve them by obstinate rebellion and ingratitude (to Allah and man).

source: فأردنا أن يبدلهما ربهما خيرا منه زكاة وأقرب رحما
en: "So we desired that their Lord would give them in exchange (a son) better in purity (of conduct) and closer in affection.

source: وأما الجدار فكان لغلامين يتيمين في المدينة وكان تحته كنز لهما وكان أبوهما صالحا فأراد ربك أن يبلغا أشدهما ويستخرجا كنزهما رحمة من ربك وما فعلته عن أمري ذلك تأويل ما لم تسطع عليه صبرا
en: "As for the wall, it belonged to two youths, orphans, in the Town; there was, beneath it, a buried treasure, to which they were entitled: their father had been a righteous man: So thy Lord desired that they should attain their age of full strength and get out their treasure - a mercy (and favour) from thy Lord. I did it not of my own accord. Such is the interpretation of (those things) over which thou wast unable to hold patience."

source: ويسألونك عن ذي القرنين قل سأتلو عليكم منه ذكرا
en: They ask thee concerning Zul-qarnain. Say, "I will rehearse to you something of his story."

source: إنا مكنا له في الأرض وآتيناه من كل شيء سببا
en: Verily We established his power on earth, and We gave him the ways and the means to all ends.

source: فأتبع سببا
en: One (such) way he followed,

source: حتى إذا بلغ مغرب الشمس وجدها تغرب في عين حمئة ووجد عندها قوما قلنا يا ذا القرنين إما أن تعذب وإما أن تتخذ فيهم حسنا
en: Until, when he reached the setting of the sun, he found it set in a spring of murky water: Near it he found a People: We said: "O Zul-qarnain! (thou hast authority,) either to punish them, or to treat them with kindness."

source: قال أما من ظلم فسوف نعذبه ثم يرد إلى ربه فيعذبه عذابا نكرا
en: He said: "Whoever doth wrong, him shall we punish; then shall he be sent back to his Lord; and He will punish him with a punishment unheard-of (before).

source: وأما من آمن وعمل صالحا فله جزاء الحسنى وسنقول له من أمرنا يسرا
en: "But whoever believes, and works righteousness,- he shall have a goodly reward, and easy will be his task as We order it by our Command."

source: ثم أتبع سببا
en: Then followed he (another) way,

source: حتى إذا بلغ مطلع الشمس وجدها تطلع على قوم لم نجعل لهم من دونها سترا
en: Until, when he came to the rising of the sun, he found it rising on a people for whom We had provided no covering protection against the sun.

source: كذلك وقد أحطنا بما لديه خبرا
en: (He left them) as they were: We completely understood what was before him.

source: حتى إذا بلغ بين السدين وجد من دونهما قوما لا يكادون يفقهون قولا
en: Until, when he reached (a tract) between two mountains, he found, beneath them, a people who scarcely understood a word.

source: قالوا يا ذا القرنين إن يأجوج ومأجوج مفسدون في الأرض فهل نجعل لك خرجا على أن تجعل بيننا وبينهم سدا
en: They said: "O Zul-qarnain! the Gog and Magog (People) do great mischief on earth: shall we then render thee tribute in order that thou mightest erect a barrier between us and them?

source: قال ما مكني فيه ربي خير فأعينوني بقوة أجعل بينكم وبينهم ردما
en: He said: "(The power) in which my Lord has established me is better (than tribute): Help me therefore with strength (and labour): I will erect a strong barrier between you and them:

source: آتوني زبر الحديد حتى إذا ساوى بين الصدفين قال انفخوا حتى إذا جعله نارا قال آتوني أفرغ عليه قطرا
en: "Bring me blocks of iron." At length, when he had filled up the space between the two steep mountain-sides, He said, "Blow (with your bellows)" Then, when he had made it (red) as fire, he said: "Bring me, that I may pour over it, molten lead."

source: فما اسطاعوا أن يظهروه وما استطاعوا له نقبا
en: Thus were they made powerless to scale it or to dig through it.

source: قال هذا رحمة من ربي فإذا جاء وعد ربي جعله دكاء وكان وعد ربي حقا
en: He said: "This is a mercy from my Lord: But when the promise of my Lord comes to pass, He will make it into dust; and the promise of my Lord is true."

source: وتركنا بعضهم يومئذ يموج في بعض ونفخ في الصور فجمعناهم جمعا
en: On that day We shall leave them to surge like waves on one another: the trumpet will be blown, and We shall collect them all together.

source: وعرضنا جهنم يومئذ للكافرين عرضا
en: And We shall present Hell that day for Unbelievers to see, all spread out,-

source: الذين كانت أعينهم في غطاء عن ذكري وكانوا لا يستطيعون سمعا
en: (Unbelievers) whose eyes had been under a veil from remembrance of Me, and who had been unable even to hear.

source: أفحسب الذين كفروا أن يتخذوا عبادي من دوني أولياء إنا أعتدنا جهنم للكافرين نزلا
en: Do the Unbelievers think that they can take My servants as protectors besides Me? Verily We have prepared Hell for the Unbelievers for (their) entertainment.

source: قل هل ننبئكم بالأخسرين أعمالا
en: Say: "Shall we tell you of those who lose most in respect of their deeds?-

source: الذين ضل سعيهم في الحياة الدنيا وهم يحسبون أنهم يحسنون صنعا
en: "Those whose efforts have been wasted in this life, while they thought that they were acquiring good by their works?"

source: أولئك الذين كفروا بآيات ربهم ولقائه فحبطت أعمالهم فلا نقيم لهم يوم القيامة وزنا
en: They are those who deny the Signs of their Lord and the fact of their having to meet Him (in the Hereafter): vain will be their works, nor shall We, on the Day of Judgment, give them any weight.

source: ذلك جزاؤهم جهنم بما كفروا واتخذوا آياتي ورسلي هزوا
en: That is their reward, Hell, because they rejected Faith, and took My Signs and My Messengers by way of jest.

source: إن الذين آمنوا وعملوا الصالحات كانت لهم جنات الفردوس نزلا
en: As to those who believe and work righteous deeds, they have, for their entertainment, the Gardens of Paradise,

source: خالدين فيها لا يبغون عنها حولا
en: Wherein they shall dwell (for aye): no change will they wish for from them.

source: قل لو كان البحر مدادا لكلمات ربي لنفد البحر قبل أن تنفد كلمات ربي ولو جئنا بمثله مددا
en: Say: "If the ocean were ink (wherewith to write out) the words of my Lord, sooner would the ocean be exhausted than would the words of my Lord, even if we added another ocean like it, for its aid."

source: قل إنما أنا بشر مثلكم يوحى إلي أنما إلهكم إله واحد فمن كان يرجو لقاء ربه فليعمل عملا صالحا ولا يشرك بعبادة ربه أحدا
en: Say: "I am but a man like yourselves, (but) the inspiration has come to me, that your Allah is one Allah: whoever expects to meet his Lord, let him work righteousness, and, in the worship of his Lord, admit no one as partner.

source: كهيعص
en: Kaf. Ha. Ya. 'Ain. Sad.

source: ذكر رحمت ربك عبده زكريا
en: (This is) a recital of the Mercy of thy Lord to His servant Zakariya.

source: إذ نادى ربه نداء خفيا
en: Behold! he cried to his Lord in secret,

source: قال رب إني وهن العظم مني واشتعل الرأس شيبا ولم أكن بدعائك رب شقيا
en: Praying: "O my Lord! infirm indeed are my bones, and the hair of my head doth glisten with grey: but never am I unblest, O my Lord, in my prayer to Thee!

source: وإني خفت الموالي من ورائي وكانت امرأتي عاقرا فهب لي من لدنك وليا
en: "Now I fear (what) my relatives (and colleagues) (will do) after me: but my wife is barren: so give me an heir as from Thyself,-

source: يرثني ويرث من آل يعقوب واجعله رب رضيا
en: "(One that) will (truly) represent me, and represent the posterity of Jacob; and make him, O my Lord! one with whom Thou art well-pleased!"

source: يا زكريا إنا نبشرك بغلام اسمه يحيى لم نجعل له من قبل سميا
en: (His prayer was answered): "O Zakariya! We give thee good news of a son: His name shall be Yahya: on none by that name have We conferred distinction before."

source: قال رب أنى يكون لي غلام وكانت امرأتي عاقرا وقد بلغت من الكبر عتيا
en: He said: "O my Lord! How shall I have a son, when my wife is barren and I have grown quite decrepit from old age?"

source: قال كذلك قال ربك هو علي هين وقد خلقتك من قبل ولم تك شيئا
en: He said: "So (it will be) thy Lord saith, 'that is easy for Me: I did indeed create thee before, when thou hadst been nothing!'"

source: قال رب اجعل لي آية قال آيتك ألا تكلم الناس ثلاث ليال سويا
en: (Zakariya) said: "O my Lord! give me a Sign." "Thy Sign," was the answer, "Shall be that thou shalt speak to no man for three nights, although thou art not dumb."

source: فخرج على قومه من المحراب فأوحى إليهم أن سبحوا بكرة وعشيا
en: So Zakariya came out to his people from him chamber: He told them by signs to celebrate Allah's praises in the morning and in the evening.

source: يا يحيى خذ الكتاب بقوة وآتيناه الحكم صبيا
en: (To his son came the command): "O Yahya! take hold of the Book with might": and We gave him Wisdom even as a youth,

source: وحنانا من لدنا وزكاة وكان تقيا
en: And piety (for all creatures) as from Us, and purity: He was devout,

source: وبرا بوالديه ولم يكن جبارا عصيا
en: And kind to his parents, and he was not overbearing or rebellious.

source: وسلام عليه يوم ولد ويوم يموت ويوم يبعث حيا
en: So Peace on him the day he was born, the day that he dies, and the day that he will be raised up to life (again)!

source: واذكر في الكتاب مريم إذ انتبذت من أهلها مكانا شرقيا
en: Relate in the Book (the story of) Mary, when she withdrew from her family to a place in the East.

source: فاتخذت من دونهم حجابا فأرسلنا إليها روحنا فتمثل لها بشرا سويا
en: She placed a screen (to screen herself) from them; then We sent her our angel, and he appeared before her as a man in all respects.

source: قالت إني أعوذ بالرحمن منك إن كنت تقيا
en: She said: "I seek refuge from thee to (Allah) Most Gracious: (come not near) if thou dost fear Allah."

source: قال إنما أنا رسول ربك لأهب لك غلاما زكيا
en: He said: "Nay, I am only a messenger from thy Lord, (to announce) to thee the gift of a holy son.

source: قالت أنى يكون لي غلام ولم يمسسني بشر ولم أك بغيا
en: She said: "How shall I have a son, seeing that no man has touched me, and I am not unchaste?"

source: قال كذلك قال ربك هو علي هين ولنجعله آية للناس ورحمة منا وكان أمرا مقضيا
en: He said: "So (it will be): Thy Lord saith, 'that is easy for Me: and (We wish) to appoint him as a Sign unto men and a Mercy from Us': It is a matter (so) decreed."

source: فحملته فانتبذت به مكانا قصيا
en: So she conceived him, and she retired with him to a remote place.

source: فأجاءها المخاض إلى جذع النخلة قالت يا ليتني مت قبل هذا وكنت نسيا منسيا
en: And the pains of childbirth drove her to the trunk of a palm-tree: She cried (in her anguish): "Ah! would that I had died before this! would that I had been a thing forgotten and out of sight!"

source: فناداها من تحتها ألا تحزني قد جعل ربك تحتك سريا
en: But (a voice) cried to her from beneath the (palm-tree): "Grieve not! for thy Lord hath provided a rivulet beneath thee;

source: وهزي إليك بجذع النخلة تساقط عليك رطبا جنيا
en: "And shake towards thyself the trunk of the palm-tree: It will let fall fresh ripe dates upon thee.

source: فكلي واشربي وقري عينا فإما ترين من البشر أحدا فقولي إني نذرت للرحمن صوما فلن أكلم اليوم إنسيا
en: "So eat and drink and cool (thine) eye. And if thou dost see any man, say, 'I have vowed a fast to (Allah) Most Gracious, and this day will I enter into not talk with any human being'"

source: فأتت به قومها تحمله قالوا يا مريم لقد جئت شيئا فريا
en: At length she brought the (babe) to her people, carrying him (in her arms). They said: "O Mary! truly an amazing thing hast thou brought!

source: يا أخت هارون ما كان أبوك امرأ سوء وما كانت أمك بغيا
en: "O sister of Aaron! Thy father was not a man of evil, nor thy mother a woman unchaste!"

source: فأشارت إليه قالوا كيف نكلم من كان في المهد صبيا
en: But she pointed to the babe. They said: "How can we talk to one who is a child in the cradle?"

source: قال إني عبد الله آتاني الكتاب وجعلني نبيا
en: He said: "I am indeed a servant of Allah: He hath given me revelation and made me a prophet;

source: وجعلني مباركا أين ما كنت وأوصاني بالصلاة والزكاة ما دمت حيا
en: "And He hath made me blessed wheresoever I be, and hath enjoined on me Prayer and Charity as long as I live;

source: وبرا بوالدتي ولم يجعلني جبارا شقيا
en: "(He) hath made me kind to my mother, and not overbearing or miserable;

source: والسلام علي يوم ولدت ويوم أموت ويوم أبعث حيا
en: "So peace is on me the day I was born, the day that I die, and the day that I shall be raised up to life (again)"!

source: ذلك عيسى ابن مريم قول الحق الذي فيه يمترون
en: Such (was) Jesus the son of Mary: (it is) a statement of truth, about which they (vainly) dispute.

source: ما كان لله أن يتخذ من ولد سبحانه إذا قضى أمرا فإنما يقول له كن فيكون
en: It is not befitting to (the majesty of) Allah that He should beget a son. Glory be to Him! when He determines a matter, He only says to it, "Be", and it is.

source: وإن الله ربي وربكم فاعبدوه هذا صراط مستقيم
en: Verily Allah is my Lord and your Lord: Him therefore serve ye: this is a Way that is straight.

source: فاختلف الأحزاب من بينهم فويل للذين كفروا من مشهد يوم عظيم
en: But the sects differ among themselves: and woe to the unbelievers because of the (coming) Judgment of a Momentous Day!

source: أسمع بهم وأبصر يوم يأتوننا لكن الظالمون اليوم في ضلال مبين
en: How plainly will they see and hear, the Day that they will appear before Us! but the unjust today are in error manifest!

source: وأنذرهم يوم الحسرة إذ قضي الأمر وهم في غفلة وهم لا يؤمنون
en: But warn them of the Day of Distress, when the matter will be determined: for (behold,) they are negligent and they do not believe!

source: إنا نحن نرث الأرض ومن عليها وإلينا يرجعون
en: It is We Who will inherit the earth, and all beings thereon: to Us will they all be returned.

source: واذكر في الكتاب إبراهيم إنه كان صديقا نبيا
en: (Also mention in the Book (the story of) Abraham: He was a man of Truth, a prophet.

source: إذ قال لأبيه يا أبت لم تعبد ما لا يسمع ولا يبصر ولا يغني عنك شيئا
en: Behold, he said to his father: "O my father! why worship that which heareth not and seeth not, and can profit thee nothing?

source: يا أبت إني قد جاءني من العلم ما لم يأتك فاتبعني أهدك صراطا سويا
en: "O my father! to me hath come knowledge which hath not reached thee: so follow me: I will guide thee to a way that is even and straight.

source: يا أبت لا تعبد الشيطان إن الشيطان كان للرحمن عصيا
en: "O my father! serve not Satan: for Satan is a rebel against (Allah) Most Gracious.

source: يا أبت إني أخاف أن يمسك عذاب من الرحمن فتكون للشيطان وليا
en: "O my father! I fear lest a Penalty afflict thee from (Allah) Most Gracious, so that thou become to Satan a friend."

source: قال أراغب أنت عن آلهتي يا إبراهيم لئن لم تنته لأرجمنك واهجرني مليا
en: (The father) replied: "Dost thou hate my gods, O Abraham? If thou forbear not, I will indeed stone thee: Now get away from me for a good long while!"

source: قال سلام عليك سأستغفر لك ربي إنه كان بي حفيا
en: Abraham said: "Peace be on thee: I will pray to my Lord for thy forgiveness: for He is to me Most Gracious.

source: وأعتزلكم وما تدعون من دون الله وأدعو ربي عسى ألا أكون بدعاء ربي شقيا
en: "And I will turn away from you (all) and from those whom ye invoke besides Allah: I will call on my Lord: perhaps, by my prayer to my Lord, I shall be not unblest."

source: فلما اعتزلهم وما يعبدون من دون الله وهبنا له إسحاق ويعقوب وكلا جعلنا نبيا
en: When he had turned away from them and from those whom they worshipped besides Allah, We bestowed on him Isaac and Jacob, and each one of them We made a prophet.

source: ووهبنا لهم من رحمتنا وجعلنا لهم لسان صدق عليا
en: And We bestowed of Our Mercy on them, and We granted them lofty honour on the tongue of truth.

source: واذكر في الكتاب موسى إنه كان مخلصا وكان رسولا نبيا
en: Also mention in the Book (the story of) Moses: for he was specially chosen, and he was a messenger (and) a prophet.

source: وناديناه من جانب الطور الأيمن وقربناه نجيا
en: And we called him from the right side of Mount (Sinai), and made him draw near to Us, for mystic (converse).

source: ووهبنا له من رحمتنا أخاه هارون نبيا
en: And, out of Our Mercy, We gave him his brother Aaron, (also) a prophet.

source: واذكر في الكتاب إسماعيل إنه كان صادق الوعد وكان رسولا نبيا
en: Also mention in the Book (the story of) Isma'il: He was (strictly) true to what he promised, and he was a messenger (and) a prophet.

source: وكان يأمر أهله بالصلاة والزكاة وكان عند ربه مرضيا
en: He used to enjoin on his people Prayer and Charity, and he was most acceptable in the sight of his Lord.
